// 1 - Развитие от 0 до 12
// 2 - консультация по развитию
// 3 - Эмоции
// 4 - рассылка ДЗ
// 5 - речевое развитие
// 6 - тайна подгузника
// 7 - срыгивание
// 8 - Вебинары по развитию
// 9 - Чат бот по сну
// 10 - Развитие от 1 - 3 лет
// 11 - Вебинар "Новые мeтодики"

module.exports = [
    {
        index: 0,
        linkToTilda: 'https://landinghw.kornevgmbh.com/',
        title: 'Ежедневно развивать малыша',
        subTitle: 'с <strong>рассылкой</strong> домашних заданий<br>для Вашего возраста',
        showBF: true,
        img: ['4_1.png', '4_2.png', '4_3.png'],
        description:
            '<div class="card-description text-left">\n' +
            '<p><strong>С детальными видео и текстовыми заданиями&nbsp;</strong></p>\n' +
            '<p>по развитию речи, двигательной активности и эмоционального интеллекта.</p>\n' +
            '<p><strong>Удобно и доступно</strong></p>\n' +
            '<p>с рассылками&nbsp; в ваш Телеграм-аккаунт&nbsp; теории, тестов, гайдов и домашних заданий.</p>\n' +
            '<p><strong>С адаптированными под возраст ребенка материалами, </strong></p>\n' +
            '<p>доступными&nbsp; от 3 недель до 2 лет</p>\n' +
            '<p><strong>Без необходимости покупать дополнительное оборудование</strong></p>\n' +
            '<p>все задания выполняются без финансовых затрат</p>' +
            '</div>',
        linkIn: 'allSendIntro',
        linkLanding: '',
        access: false
    },
    {
        index: 1,
        linkToTilda: 'https://landing.kornevgmbh.com/',
        // linkToTilda: ' http://elenakorneva.ru/webinars',
        title: 'Вырастить успешную личность',
        showBF: true,
        subTitle: 'с <strong>вебинарами</strong>  по гармоничному<br>  развитиюмалышей от 0 до 24 мес. ',
        img: ['8_1.png', '8_2.png', '8_3.png'],
        description: '<div class="card-description text-left">\n' +
            '<ul>\n' +
            '<li>Уникальные вебинары с простыми и&nbsp; понятными объяснениями сложных процессов детского развития</li>\n' +
            '<li>Содержат концентрированную и полезную информацию по каждому возрастному периоду</li>\n' +
            '<li>Подробно разъясняют какими действиями Вы можете достичь максимальных результатов в развитии крохи</li>\n' +
            '</ul>\n' +
            '</div>',
        linkIn: '/mainPageWebinar',
        linkLanding: '',
        access: false
    },
    {
        index: 1,
        linkToTilda: 'https://elenakorneva.ru/new-landing-superstar',
        // linkToTilda: 'https://t.me/mrk_new_bot?start=record',
        title: 'Интенсив "Растим звезду"',
        greenTitle: 'Интенсив "Растим звезду"',
        subTitle: 'легендарный годовой курс<br> развития мамы и ребенка',
        showBF: true,
        img: ['1_1.png', '1_2.png', '1_3.png'],
        description: '<div class="card-description text-left">\n' +
            '<p>ВСЕ&nbsp; ДЛЯ&nbsp; ВОЗРАСТА ВАШЕГО МАЛЫША</p>\n' +
            '<ul>\n' +
            '<li>персонализированные рекомендации</li>\n' +
            '<li>домашние задания</li>\n' +
            '<li>вебинары</li>\n' +
            '<li>тесты</li>\n' +
            '<li>видеолекции</li>\n' +
            '<li>web-приложения</li>\n' +
            '<li>чат-боты</li>\n' +
            '<li>сопровождение кураторов и автора&nbsp;</li>\n' +
            '</ul>\n' +
            '<p>ЦЕЛЫЙ ГОД ИНДИВИДУАЛЬНОГО РАЗВИТИЯ</p>\n' +
            '<p>Вы и Ваша кроха включаетесь в работу на следующие 12 месяцев под регулярным сопровождением команды легендарного эксперта</p>\n' +
            '<p>ВКЛЮЧЕНЫ АВТОРСКИЕ КУРСЫ&nbsp;</p>\n' +
            '<p>В рамках годовой программы гарантированно прохождение с кураторской поддержкой, как минимум, двух флагаманских курсов</p>\n' +
            '<p>РАБОТА С ЧАТ-БОТАМИ И ПРИЛОЖЕНИЯМИ</p>\n' +
            '<p>Ежемесячное тестирование эмоционального, физического и речевого развития ребенка с получением индивидуальных рекомендаций на следующий месяц</p>\n' +
            '<p>ПРИНЯТИЕ МАТЕРИНСТВА</p>\n' +
            '<p>Уменьшение тревожности, уверенное эмоциональное взаимодействие с ребёнком, семьей и окружающим миром</p>\n' +
            '<p>АУДИТ СЕМЬИ И ИНДИВИДУАЛЬНЫЙ ПЛАН РАЗВИТИЯ</p>\n' +
            '<p>Первичное составление карты семьи с дальнейшим ведением и консультированием в период интенсива (3 месяца) и выдача рекомендаций по развитию ребенка на следующие 9 месяцев</p>\n' +
            '<p>ФИЗИОЛОГИЧНО, ГАРМОНИЧНО, ТОЧЕЧНО</p>\n' +
            '<p>Физиологическое развитие с учетом готовности ребенок с помощью эффективной методики точеного кратковременного (1-2 минуты) воздействия</p>' +
            '</div>',
        linkIn: '#',
        linkLanding: '',
        access: false
    },
    {
        index: 2,
        linkToTilda: 'https://t.me/HelenEventBot?start=start',
        title: 'Вырастить гармоничного ребенка ',
        greenTitle: 'Вырастить гармоничного ребенка',
        subTitle: 'Бесплатный стартовый курс',
        showBF: false,
        img: ['2_1.png', '2_2.png', '2_3.png'],
        description: '<div class="card-description text-left">\n' +
            '<ol>\n' +
            '<li>\n' +
            '<p><strong>Индивидуальное развитие:</strong> Создайте уникальное обучающее окружение, поддерживая потребности малыша и стимулируя его естественные таланты и интересы.</p>\n' +
            '</li>\n' +
            '<li>\n' +
            '<p><strong>Раннее обучение:</strong> Используйте инновационные методики раннего обучения, включая игры, книги и музыку, для развития мозга и когнитивных навыков.</p>\n' +
            '</li>\n' +
            '<li>\n' +
            '<p><strong>Творческие занятия:</strong> Развивайте творческие способности ребенка через искусство, музыку и танец, предоставляя доступ к профессиональным тренерам.</p>\n' +
            '</li>\n' +
            '<li>\n' +
            '<p><strong>Семейная поддержка:</strong> Содействуйте сбалансированному семейному окружению, вовлекая семью в обучающие и воспитательные процессы.</p>\n' +
            '</li>\n' +
            '<li>\n' +
            '<p><strong>Материнская поддержка:</strong> Облегчайте материнство предоставлением полезных ресурсов и организацией мероприятий для осознанной поддержки родителей.</p>\n' +
            '</li>\n' +
            '</ol>' +
            '</div>',
        linkIn: '#',
        linkLanding: '',
        access: false
    },
    {
        index: 3,
        linkToTilda: 'https://landing-emo.kornevgmbh.com/',
        title: 'Истерики в прошлом',
        greenTitle: 'Как эффективно управлять эмоциями ребенка',
        subTitle: 'Управлять эмоциями ребенка',
        showBF: true,
        img: ['3_2.png', '3_2.png', '3_3.png'],
        description: '<div class="card-description text-left">\n' +
            '<p class="mb-2">Курс для вас, если ваш малыш:</p> ' +
            '<ul>\n' +
            '<li>Уже проявляет яркие эмоции и ему от 5 до 36 месяцев</li>\n' +
            '<li>Не знает и понимает границ</li>\n' +
            '<li>Устраивает истерики дома, на улице или в общественном месте</li>\n' +
            '<li>Кусает , щипает, дергает за волосы и вы не знаете что с этим делать</li>\n' +
            '<li>Не слушается Вас и не реагирует на слова</li>\n' +
            '<li>Проявляет агрессию или плачет по любому поводу</li>\n' +
            '<li>Лезет в опасные места, игнорируя запреты</li>\n' +
            '</ul>' +
            '<p class="my-2">И если Вы:</p> ' +
            '<ul>\n' +
            '<li>Бессильны при выплеске эмоций ребенка</li>\n' +
            '<li>Чувствуете вину за эмоциональные срывы и крики</li>\n' +
            '<li>Не можете планировать жизнь из-за внезапных эмоциональных реакций ребенка</li>\n' +
            '<li>Испытываете страх перед появлением новых эмоций</li>\n' +
            '<li>Считаете себя плохим родителем</li>\n' +
            '<li>Боитесь посещений общественных мест из-за возможной негативной реакциий ребенка</li>\n' +
            '</ul>' +
            '</div>',
        linkIn: '/emoPageIntro',
        linkLanding: '',
        access: false
    },

    {
        index: 10,
        linkToTilda: '/speakLandingSpecial',
        title: 'доРечевой 30-дневный интенсив',
        greenTitle: 'доРечевой интенсив',
        subTitle: '<div class="card-sub-title">"От звука к слову"</div>',
        showBF: true,
        img: ['5_2.png', '5_2.png', '5_3.png'],
        description: ' <div class="card-description text-left">\n' +
            '<p class="mb-2">Этот интенсив для Вас, если:</p>' +
            '<ul>\n' +
            '<li>Вас волнуют вопросы, связанные с речью вашего малыша, и вы устали от противоречивой и неполной информации в интернете</li>\n' +
            '<li>Вы не готовы &laquo;ждать до 3 лет&raquo;, чтобы после исправлять уже сформировавшиеся проблемы с речью вашего ребенка</li>\n' +
            '<li>Вы сомневаетесь, все ли в порядке с речевым развитием вашего малыша, и не до конца понимаете, что вам делать&nbsp;</li>\n' +
            '<li>Вам важно понимать, как на самом деле устроена речь вашего ребенка, и как работать с ней эффективно и правильно</li>\n' +
            '<li>Ваш малыш родился раньше срока или были проблемы во время беременности или родов</li>\n' +
            '<li>Ваш ребенок растет в семье, где используют два и более языка</li>\n' +
            '</ul>' +
            '<p class="mb-2">С какими проблемами поможет интенсив?</p>' +
            '<ul>\n' +
            '<li>Ребенок не стремится говорить или использовать речь для коммуникации</li>\n' +
            '<li>Малыш ограничивается использованием одного слога или звука вместо полных слов</li>\n' +
            '<li>Ребенок не расширяет свой активный словарь и не повторяет слова, которые слышит</li>\n' +
            '<li>Малыш полагается на жесты или мимику, вместо использования слов для выражения своих потребностей или желаний</li>\n' +
            '<li>Ребенок не реагирует или не отзывается на свое имя, когда его зовут</li>\n' +
            '<li>Малыш испытывает трудности в понимании или выполнении простых инструкций</li>\n' +
            '<li>Ребенок использует ограниченное количество слов и не проявляет стремления произносить новые слова</li>\n' +
            '<li>Малыш произносит отдельные слова, но не способен составить связные фразы или предложения</li>\n' +
            '<li>Ребенок испытывает трудности в установлении речевого контакта и взаимодействии с родителями и сверстниками</li>\n' +
            '<li>Малыш имеет недостаточный уровень речевого развития по сравнению со сверстниками</li>\n' +
            '</ul>' +
            '</div>',
        linkIn: '/speakPageIntro',
        linkLanding: '',
        access: false
    },
    {
        index: 6,
        linkToTilda: 'https://diaper.kornevgmbh.com/',
        title: 'Cекреты ЖКТ крохи',
        greenTitle: 'Проблемы животика и кишечника ребенка от 0 месяцев',
        subTitle: 'Газики, колики, запоры, какашечки и др.</strong>',
        showBF: true,
        img: ['6_1.png', '6_2.png', '6_2.png'],
        description:
            '<div class="card-description text-left">\n' +
            '<li>Как работает желудочно-кишечный тракт крохи в период бурного роста и развития?</li>\n' +
            '<li>Когда бежать за помощью, а что является вариантом нормального развития?</li>\n' +
            '<li>Как помочь и не навредить? Какие пробиотики, пребиотики, ферменты и препараты от запоров действительно нужны вашему малышу?</li>\n' +
            '<p>Весь материал - это увлекательное путешествие по организму ребенка с его особенностями и потребностями.</p>\n' +
            '</ul> ' +
            '</div>',
        linkIn: '/diaperMystery',
        linkLanding: '',
        access: false
    },
    {
        index: 7,
        linkToTilda: 'https://t.me/HelenEventBot?start=start',
        title: 'Разобраться в проблеме срыгивания',
        subTitle: 'с помощью <strong>тест-курса</strong>',
        showBF: false,
        img: ['7_1.png', '7_1.png', '7_1.png'],
        description:
            '<div class="card-description text-left">\n' +
            '<ul>\n' +
            '<li>Бесплатная Web-приложение</li>\n' +
            '<li>Поняв, почему происходят срыгивания именно у Вашего ребенка</li>\n' +
            '<li>Определившись насколько серьезна ситуация со срыгиванием у малыша, стоит ли бить тревогу и срочно бежать за помощью</li>\n' +
            '<li>Научившись применять простые, но эффективные стратегии в зависимости от состояния крохи</li>\n' +
            '<li>Пройдя индивидуальное тестирование и получив рекомендации для конкретного случая</li>\n' +
            '</ul>' +
            '</div>',
        linkIn: '#',
        linkLanding: '',
        access: false
    },

    {
        index: 9,
        linkToTilda: 'https://landing-dream.kornevgmbh.com/',
        // linkToTilda: 'https://landing-dream.kornevgmbh.com/',
        title: 'Наладить сон ребенка',
        subTitle: 'научив его самостоятельному<br> засыпанию с помощью <strong>Чат-бота по сну</strong>',
        img: ['9_2.png', '9_2.png', '9_3.png'],
        showBF: true,
        description:
            '<div class="card-description text-left">\n' +
            '<ul>\n' +
            '<li>на основе одной из четырех методик, обучив самостоятельному засыпанию</li>\n' +
            '<li>избавив от недосыпа всю семью</li>\n' +
            '<li>с наиболее подходящей по возрасту методикой, решая проблемы:\n' +
            '<ul>\n' +
            '<li> раннего пробуждения</li>\n' +
            '<li> бесконечных ночных кормлений</li>\n' +
            '<li> "часовых" укладываний</li>\n' +
            '<li> частых пробуждений</li>\n' +
            '<li> утомительных укачиваний&nbsp;и др.</li>\n' +
            '</ul>\n' +
            '</li>\n' +
            '</ul>' +
            '</div>',
        linkIn: '/mainPageIntro',
        linkLanding: '',
        access: false
    },
    {
        index: 5,
        linkToTilda: 'http://elenakorneva.ru/more_one_year',
        title: 'Я - САМ',
        subTitle: 'Развитие ребенка от 1 до 3 лет',
        img: ['10_3.png', '10_3.png', '10_3.png'],
        description: '<div class="card-description text-left">\n' +
            '<p><strong>Вы заинтересованы в том, чтобы ваш малыш вырос гармоничной и успешной личностью? Тогда этот курс предназначен именно для вас, потому что он предоставляет все необходимое в одном месте:</strong></p>\n' +
            '<ul>\n' +
            '<li aria-level="1">Включение в процесс развития с первого дня (алгоритм учитывает возраст ребенка точно до недели, так что задания будут соответствовать его возрасту, Например, если малышу 6 месяцев и 3 недели, то задания будут разработаны для этого возраста)</li>\n' +
            '<li aria-level="1">Тестирование психомоторного развития ребенка и формирование рекомендаций, основываясь на индивидуальных особенностях тестируемого</li>\n' +
            '<li aria-level="1">Ежедневное получение заданий, направленных на гармоничное развитие личности (включая развитие речи, моторики и эмоционального интеллекта)</li>\n' +
            '<li aria-level="1">Ежедневное усвоение теоретических знаний о особенностях данного возраста</li>\n' +
            '<li aria-level="1">Учет вариантов более интенсивного развития или ситуаций, когда малышу трудно (техническая служба адаптирует задания под такие случаи)</li>\n' +
            '<li aria-level="1">Использование гайдов с рекомендациями для данного возраста и для мам</li>\n' +
            '<li aria-level="1">Получение дополнительных рекомендаций и новые подходы в развитии</li>\n' +
            '<li aria-level="1">Использование огромной библиотеки дополнительных материалов</li>\n' +
            '</ul>\n' +
            '</div>',
        linkIn: '#',
        linkLanding: '',
        access: false
    },
    {
        index: 11,
        linkToTilda: 'http://elenakorneva.ru/new-webinar',
        title: 'Подготовить к яркому будущему',
        subTitle: 'c <strong>вебинаром </strong>  о саморазвивающейся<br> системе мозга малыша',
        img: ['11_1.png', '11_2.png', '11_3.png'],
        description:
            '<div class="card-description text-left">\n' +
            '<ul>\n' +
            '<li>разобравшись, как на самом деле работает детский мозг по данным последних исследований</li>\n' +
            '<li>узнав о возможностях саморазвивающейся модели усвоения информации у ребенка на этапе формирования</li>\n' +
            '<li>получив сведения о том как с помощью простых действий обучить мозг ребенка.</li>\n' +
            '</ul>' +
            '<p><strong>Подходит для детей от 0 до 5 лет.</strong></p>' +
            '</div>',
        linkIn: '/mainPageWebinar',
        linkLanding: '',
        access: false
    }
]

// 1 - Развитие от 0 до 12
// 2 - консультация по развитию
// 3 - Эмоции
// 4 - рассылка ДЗ
// 5 - речевое развитие
// 6 - тайна подгузника
// 7 - срыгивание
// 8 - Вебинары по развитию
// 9 - Чат бот по сну
// 10 - Развитие от 1 - 3 лет
// 11 - Вебинар "Новые мeтодики"
